Repository: SimonOnyszczakHansen/Website
Catalog: src/locale/messages.*.xlf
Languages: da

# back button for going back to the previous page
source: <i class="fas fa-arrow-left"></i> Back
da: <i class="fas fa-arrow-left"></i> Tilbage

source: Datatechnician with focus on programming
da: Datatekniker med speciale i programmering

source: My Name Is <span>Simon Onyszczak Hansen</span>
da: Mit Navn er <span>Simon Onyszczak Hansen</span>

source: Hi, My Name Is <span>Simon Onyszczak Hansen</span>
da: Hej, Mit Navn er <span>Simon Onyszczak Hansen</span>

source: A passionate developer with a burning passion for Frontend and UX/UI design.
da: En passioneret udvikler med stor interesse for Frontend og UI/UX design.

# main header for about me section
source: About Me
da: Om mig

# short description about myself
source: Hi! I'm Simon, a 20-year-old passionate developer with a love for IT and programming.
da: Hej! Jeg er Simon, en 20-årig passioneret udvikler med stor passion for IT og Programmering.

# card for where i am studying
source: Studying at ZBC Ringsted
da: Studerer på ZBC Ringsted

# card to explain what project i am currently working on
source: Working on a Virtual reality app
da: Arbejder på en VR-app

# card for football details
source: Football Enthusiast
da: Fodbold Enthusiast

# card for relocation
source: Open to Relocation anywhere in Denmark
da: Er åben for at flytte hvor som helst i Danmark

# header for carousel
source: My Skills
da: Mine Færdigheder

# main header for my strengths
source: My Strengths
da: Mine Styrker

# flexibility card header
source: Flexibility
da: Fleksibilitet

# flexibility card description
source: I’m open to relocating anywhere in Denmark for the right opportunity. Embracing new environments and challenges excites me.
da: Jeg er åben for at flytte hvor som helst i Danmark for den rette mulighed. Det er spændende med nye udfordringer og miljøer.

# adaptability card header
source: Adaptability
da: Tilpasningsevne

# adaptability card description
source: Thriving in dynamic environments, I quickly adapt to changes, ensuring success in fast-paced projects.
da: Jeg trives i dynamiske omgivelser og tilpasser mig hurtigt til ændringer, hvilket sikrer succes i projekter med højt tempo.

# teamwork card header
source: Teamwork
da: Samarbejde

# teamwork card description
source: Collaborating with teams to bring ideas to life excites me. My collaborative approach fosters productive teamwork and successful outcomes.
da: Det begejstrer mig at samarbejde med hold om at bringe idéer til virkelighed. Min samarbejdsorienterede tilgang fremmer produktivt teamwork og succesfulde resultater.

# problem solving card header
source: Problem Solving
da: Problemløsning

# problem solving card description
source: Solving complex problems with elegant code drives me. I approach every challenge with a logical and creative mindset.
da: Jeg elsker at løse svære problemer med enkel kode. Jeg griber alle udfordringer an med logik og kreativitet.

# Creativity card header
source: Creativity
da: Kreativitet

# Creativity card description
source: With an eye for design, I bring creativity to each project, crafting visually stunning interfaces.
da: Jeg har øje for design og tilføjer kreativitet til hvert projekt ved at skabe flotte brugergrænseflader.

# communication card header
source: Communication
da: Kommunikation

# communication card description
source: Effective communication is key. I prioritize clear exchanges to ensure everyone is aligned and informed.
da: Effektiv kommunikation er vigtig. Jeg sørger for klare beskeder, så alle er på samme side og informeret.

source: Paperboy
da: Avisbud

source: Delivered the papers for Folketidende in my local area
da: Kørte med aviser for Folketidende i mit lokale område

source: Jan 2022 - July 2022
da: Jan 2022 - Juli 2022

source: Basic Course 2: Data & Communication
da: Grundforløb 2: Data & Kommunikation

source: took the basic course 2 for data and communication to start my career as a developer
da: Jeg tog Grundforløb 2 i data og kommunikation for at starte my uddannelse som programmør

source: Aug 2022 - Oct 2022
da: Aug 2022 - Okt 2022

source: apr 2023 - june 2023
da: Apr 2023 - Juni 2023

source: Oct 2024 - Jan 2025
da: Okt 2024 - Jan 2025

# main header for contact page
source: Contact <span>Me</span>
da: Kontakt <span>Mig</span>

# under header for contact page
source: Feel free to get in touch with me. I'd love to hear from you!
da: Du må meget gerne kontakte mig. jeg vil meget gerne høre fra dig!

# header for send message form
source: Send a Message
da: Send en besked

# label for header for the name box
source: Your Name
da: Dit Navn

# label for header for email box
source: Your Email
da: Din Email

# label for header for message box
source: Your Message
da: Din Besked

# send message text for button
source: Send Message
da: Send Besked

# header for contact information form
source: Contact Information
da: Kontakt Information

# underheader for contact information form
source: You can also reach me here:
da: Du kan også fange mig her:

# text for phone number
source: <i class="fas fa-phone"></i><span class="contactInfoHeader">Phone: </span><span id="phoneNumber"><span id="countryCode">+45</span> 24 87 65 84</span>
da: <i class="fas fa-phone"></i><span class="contactInfoHeader">Telefon: </span><span id="phoneNumber"><span id="countryCode">+45</span> 24 87 65 84</span>

# text for location
source: <i class="fas fa-map-marker-alt"></i><span class="contactInfoHeader">Location: </span> Nysted, Denmark
da: <i class="fas fa-map-marker-alt"></i><span class="contactInfoHeader">Lokation: </span> Nysted, Danmark

# Main heading|
source: Transforming Ideas into <span>Digital Realities</span>
da: Transformerer Idéer til <span>Digitale Realiteter</span>

# Short introduction|A brief introduction of my name and background
source: Hi! I'm Simon Onyszczak Hansen, a datatechnician focused on programming.
da: Hej! Jeg er Simon Onyszczak Hansen, en Datatekniker med speciale i programmering

# button that is on the main page for routing to contact page
source: Get in contact <i class="fas fa-arrow-right"></i>
da: Kom i Kontakt <i class="fas fa-arrow-right"></i>

# Navbar home link
source: Home
da: Hjem

# Navbar projects link
source: Projects
da: Projekter

# Navbar about link
source: About
da: Om

# Navbar contact link
source: Contact
da: Kontakt

# Back button for going ack to the previous page
source: <i class="fas fa-arrow-left"></i> Back
da: <i class="fas fa-arrow-left"></i> Tilbage

# Project details header
source: Information about <span>{{ project.title }}</span>
da: Information om <span>{{ project.title }}</span>

source: Password Generator
da: Adgangskode Generator

source: Introduction
da: Introduktion

source: The Password Generator is built around the idea that a strong password should not only resist brute-force attacks but also be easy to remember. It accomplishes this by letting users input personal words—such as hobbies, colors, and numbers—and blending them with special characters, uppercase options, and random placement to produce unique combinations. The generator ensures the final result meets modern security standards, including length and character variety, while remaining personal enough to recall without hassle. In the screenshot, you can see the main interface labeled “Adgangskode Generator” (Danish for “Password Generator”), where users add their interests and favorite number. Sliders let you adjust how many letters to pull from each interest and set the total password length, along with toggles for using special characters and capitalization.
da: Adgangskodegeneratoren er baseret på idéen om, at en stærk adgangskode ikke blot skal modstå brute-force-angreb, men også være nem at huske. Det opnås ved at lade brugerne indtaste personlige ord – som hobbyer, farver og tal – og blande dem med specialtegn, store bogstaver og tilfældig placering for at skabe unikke kombinationer. Generatoren sikrer, at det endelige resultat lever op til moderne sikkerhedsstandarder med hensyn til både længde og tegnvariation, samtidig med at det forbliver personligt nok til at huske uden besvær. I skærmbilledet kan du se hovedgrænsefladen mærket “Adgangskode Generator”, hvor brugerne tilføjer deres interesser og yndlingstal. Skydere lader dig justere, hvor mange bogstaver der trækkes fra hver interesse, og indstille den samlede adgangskodelængde, samt vippekontakter til brug af specialtegn og kapitalisering.

source: Key Features
da: Hovedfunktioner

source: One of its central features is dynamic input: interests and numbers can be typed or chosen from predefined lists, making it easy to experiment with different memorable words. A built-in mechanism transforms certain Danish characters into symbols for enhanced security, automatically detecting if the browser is in Danish or English. On-screen sliders let users instantly adjust overall length or how many letters are extracted from each interest. The generator evaluates password strength on the spot, highlighting whether it meets criteria such as lowercase, uppercase, numbers, special characters, and overall length. Once a base password is formed, an additional slider allows for appending abbreviated service names, ensuring that each login (such as for Facebook, Google, or LinkedIn) gets a unique, traceable—yet still memorable—password.
da: En af hovedfunktionerne er dynamisk input: interesser og tal kan skrives eller vælges fra foruddefinerede lister, så det er nemt at eksperimentere med forskellige let huskelige ord. En indbygget mekanisme omdanner visse danske bogstaver til symboler for øget sikkerhed og registrerer automatisk, om browseren er på dansk eller engelsk. Skydere på skærmen lader brugerne øjeblikkeligt justere den samlede længde eller antallet af bogstaver, der udtrækkes fra hver interesse. Generatoren vurderer adgangskodens styrke på stedet og markerer, om den opfylder kriterier som små bogstaver, store bogstaver, tal, specialtegn og samlet længde. Når en grundkode er dannet, giver en ekstra skyder mulighed for at tilføje forkortede tjenestenavne, så hver login (f.eks. Facebook, Google eller LinkedIn) får en unik, sporbar – men stadig let huskelig – adgangskode.

source: Technology and Implementation
da: Teknologi og Implementering

source: The project uses HTML, CSS, and Vanilla JavaScript for a responsive, intuitive single-page application. The code dynamically enforces rules as you type, instantly updating what the password might look like and whether it meets the criteria. The interface is styled to adapt gracefully to different screens, and each step is designed to guide the user without overwhelming them with too many fields at once. Hoverable tooltips clarify any confusing features, such as how the special character mapping works or how many characters from a website name get appended. A short modal video can also guide new users through the entire process in case they feel uncertain about generating a secure passphrase. Below is a snippet demonstrating how the generator verifies that users have specified enough interests and at least one number before enabling password creation:
da: Projektet bruger HTML, CSS og Vanilla JavaScript til en responsiv, intuitiv enkelt-side-applikation. Koden håndhæver løbende regler, mens du skriver, og opdaterer øjeblikkeligt, hvordan adgangskoden kan se ud, og om den opfylder kriterierne. Grænsefladen er designet til at tilpasse sig forskellige skærmstørrelser, og hvert trin er udformet til at vejlede brugeren uden at overvælde med for mange felter på én gang. Hover-værktøjstip forklarer eventuelle forvirrende funktioner, såsom hvordan specialtegnsmapping fungerer, eller hvor mange tegn fra et websteds navn der tilføjes. En kort modalvideo kan også guide nye brugere gennem hele processen, hvis de er usikre på at generere en sikker adgangskode. Nedenfor er et uddrag, der viser, hvordan generatoren tjekker, at brugerne har angivet nok interesser og mindst ét tal, inden adgangskodeoprettelse aktiveres:

source: This logic forms the backbone of user input validation, ensuring each password has enough complexity.
da: Denne logik er rygraden i valideringen af brugerinput og sikrer, at hver adgangskode har tilstrækkelig kompleksitet.

source: Conclusion
da: Konklusion

source: The final screenshot shows how your chosen interests (and special character conversions) are listed, along with the generated password, a color-coded strength meter, and an option to append each website’s abbreviation. This Password Generator demonstrates that memorable passwords can be strong when carefully combining personal interests with structured randomness. By automating best practices and nudging the user to include a variety of character types, it produces truly robust credentials. The multilingual functionality also extends accessibility for users, whether they prefer an English or Danish interface. Overall, this project reflects an ongoing commitment to security-minded design, offering not just raw strength but practical memorability for everyday use.
da: Det sidste skærmbillede viser, hvordan dine valgte interesser (og specialtegnskonverteringer) er vist sammen med den genererede adgangskode, en farvekodet styrkemåler og en mulighed for at tilføje forkortelser af hvert websteds navn. Denne adgangskodegenerator demonstrerer, at mindeværdige adgangskoder kan være stærke, når man omhyggeligt kombinerer personlige interesser med struktureret tilfældighed. Ved at automatisere bedste praksis og motivere brugeren til at inkludere mange forskellige tegnkategorier skaber den virkelig robuste legitimationsoplysninger. Den flersprogede funktionalitet øger også tilgængeligheden for brugere, uanset om de foretrækker en engelsk eller dansk grænseflade. Samlet set afspejler dette projekt en vedvarende forpligtelse til sikkerhedsorienteret design, der tilbyder både reel styrke og praktisk mindeværdighed til daglig brug.

source: introduction
da: introduktion

source: We call our project PortionPal SmartFeeder, and it’s basically our attempt at making life easier for pet owners who worry about whether their furry friends are eating at the right times and in the right amounts. We worked on this project at Zealand Business College under the guidance of David Svarrer. During the development, our small team combined 3D printing, embedded electronics, and a web-based control interface to create a system that monitors how much food is dispensed, collects feedback from load cells, and even lets you manage it all remotely via a user-friendly dashboard.
da: Vi kalder vores projekt PortionPal SmartFeeder, og det er i bund og grund vores forsøg på at gøre livet lettere for kæledyrsejere, der bekymrer sig om, om deres pelsede venner spiser på de rigtige tidspunkter og i de rette mængder. Vi arbejdede på dette projekt på Zealand Business College under vejledning af David Svarrer. Under udviklingen kombinerede vores lille team 3D-print, indlejrede elektroniske komponenter og en webbaseret kontrolgrænseflade for at skabe et system, der overvåger, hvor meget mad der dispenseres, indsamler data fra vægtsensorer og endda lader dig styre det hele eksternt via et brugervenligt dashboard.

source: We designed a custom enclosure that handles dry pet food using a rotating valve mechanism. The layout focuses on ensuring each part slots together without jamming, leaving room for bearings, the motor bracket, and wiring channels. By iterating on these 3D prints, we refined how the parts lined up so that the valve rotates smoothly even with repeated use. The image shows the basic shape of the dispenser, highlighting how the components stack together in the final build.
da: Vi designede en specialfremstillet indkapsling, der håndterer tørfoder ved hjælp af en roterende ventilmekanisme. Layoutet fokuserer på at sikre, at hver del passer sammen uden at sætte sig fast, med plads til lejer, motorbeslag og kabelføringskanaler. Ved at iterere på disse 3D-print har vi forfinet, hvordan delene passer præcist sammen, så ventilen roterer glat selv ved gentagen brug. Billedet viser dispenserens grundlæggende form og fremhæver, hvordan komponenterne stables sammen i den endelige opbygning.

source: The system runs on an Arduino Uno R4 WiFi, which we chose for its wireless capabilities and easy integration with the stepper motor. We used a 28BYJ-48 stepper motor (with a small driver module) to turn the valve that dispenses the pet food. Two load cells, each hooked up to an HX711 amplifier, measure food weight as it’s dispensed. If the reading is off—maybe because of a jam—the Arduino knows something went wrong. By combining these sensors with the rotating valve, we ensure the portions match whatever the owner has configured. Below is a visual representation of how we put it together.
da: Systemet kører på en Arduino Uno R4 WiFi, som vi valgte for dens trådløse kapabiliteter og nemme integration med steppermotoren. Vi brugte en 28BYJ-48 steppermotor (med et lille drivermodul) til at dreje ventilen, der dispenserer kæledyrsfoder. To vejeceller, hver koblet til en HX711-forstærker, måler fodervægten, mens den dispenseres. Hvis aflæsningen er forkert – måske på grund af en blokering – registrerer Arduinoen, at noget er galt. Ved at kombinere disse sensorer med den roterende ventil sikrer vi, at portionerne stemmer overens med ejerens indstillinger. Nedenfor er en visuel gengivelse af, hvordan vi satte det sammen.

source: We also intended to use a load cell, so we could weigh how much food was dispensed, and to track the pets eating habits. The data we collected from the load cell was supposed to be displayed on a statistics page with all the data that the user could wish for. Here is a image of what the statistics page looked like.
da: Vi havde også til hensigt at bruge en vejecelle, så vi kunne veje, hvor meget foder der blev dispenseret, og følge kæledyrets spisevaner. De data, vi indsamlede fra vejecellen, skulle vises på en statistikside med alle de oplysninger, brugeren kunne ønske sig. Her er et billede af, hvordan statistik-siden så ud.

source: The bar chart above is supposed to show how much the pet has eaten each day. The gauge diagram is supposed to show how full the bowl is.
da: Søjlediagrammet ovenfor skal vise, hvor meget kæledyret har spist hver dag. Målerdiagrammet skal vise, hvor fyldt skålen er.

source: Software and Communication
da: Software og Kommunikation

source: All Arduino logic is written in C++, managing the stepper motor’s rotation and the sensor data. The Arduino checks in with a PHP-based backend over WiFi to receive updated schedules or portion sizes. Owners interact with the feeder through an Angular frontend, where they can log in, adjust feeding times, and see historical records of how much the pet actually ate. Everything lives on GitHub for version control, allowing our team to keep track of code changes and collaborate effectively.
da: Al Arduino-logik er skrevet i C++, styrer rotationen af steppermotoren og håndterer sensordata. Arduinoen kommunikerer med en PHP-baseret backend over WiFi for at modtage opdaterede tidsplaner og portionsstørrelser. Ejere interagerer med feederen gennem en Angular-frontend, hvor de kan logge ind, justere fodringstider og se historiske optegnelser af, hvor meget kæledyret faktisk spiste. Alt er hostet på GitHub til versionskontrol, så vores team kan holde styr på kodeændringer og samarbejde effektivt.

source: This snippet shows how the Arduino securely fetches updated schedules from our server. We build a GET request URL with the API key, send it via HTTPS, and then check the response. If the server returns a 200 status, we parse the returned JSON for feeding times and portion sizes, ensuring our dispenser follows the owner’s most recent instructions.
da: Denne kode viser, hvordan Arduinoen sikkert henter opdaterede tidsplaner fra vores server. Vi opbygger en GET-anmodnings-URL med API-nøglen, sender den via HTTPS, og tjekker derefter svaret. Hvis serveren returnerer status 200, parser vi den modtagne JSON for fodringstider og portionsstørrelser, så vores dispenser følger ejerens seneste instruktioner.

source: The PortionPal SmartFeeder prototype demonstrates that it’s totally possible to automate pet feeding in a way that is both precise and user-friendly. Printing our own enclosure gave us freedom to customize the internal mechanics, while the Arduino’s WiFi capabilities made it easy to manage everything remotely. We overcame challenges around calibrating load cells and preventing valve jams, and ended up with a working system that can handle daily feeding schedules. Future ideas might include adding a camera or tracking more detailed statistics, but even in its current state, it showcases how a straightforward combination of 3D printing, embedded hardware, and a modern web stack can offer busy owners peace of mind about their pets’ nutrition.
da: Vores prototype af PortionPal SmartFeeder viser, at man sagtens kan lave en præcis og brugervenlig automatisk fodrer til kæledyr. Ved selv at 3D-printe kabinettet kunne vi tilpasse mekanikken helt efter behov, og Arduinoens indbyggede WiFi gør det nemt at styre fodringen på afstand. Vi havde lidt udfordringer med at kalibrere vægtsensorerne og undgå, at ventilerne blokerede, men dem fik vi løst. Nu kører systemet stabilt og følger de daglige fodringsplaner, vi har lagt ind. I fremtiden kunne vi fx tilføje et kamera eller samle flere data om, hvor meget og hvornår dit kæledyr spiser. Men allerede nu viser PortionPal, hvordan en enkel kombination af 3D-print, indlejret hardware og en moderne web-platform kan give travle kæledyrsejere tryghed i hverdagen.

source: Smart City Traffic Management is a project we used as an exercise when i was at school to learn how to handle big amounts of data. The assignment was to collect real time data, so we decided to to use a software called flowkit demo, which simulated a traffic light, where the software identified all the vehicles and pedestrians that passed the traffic light. Below is an image of what the software looked like.
da: Smart City Traffic Management er et projekt, vi brugte som øvelse i skolen for at lære at håndtere store mængder data. Opgaven var at indsamle realtidsdata, så vi besluttede at bruge et program kaldet Flowkit Demo, som simulerede et trafiklys, hvor softwaren identificerede alle køretøjer og fodgængere, der passerede trafiklyset. Nedenfor er et billede af, hvordan softwaren så ud.

source: In the image you can see that there is a zone. This zone is where the software could detect if there was a vehicle or a pedestrian. The gates could register if a vehicle passed through the zone.
da: I billedet kan du se, at der er en zone. I denne zone kunne softwaren registrere, om der var et køretøj eller en fodgænger. Portene kunne registrere, hvis et køretøj kørte gennem zonen.

source: Data Collection
da: Data Samling

source: Here is how our Python scripts collect data from the Flow Demo and forwards it to Kafka. In main.py we create a FlowDemo object and a Scheduler object. The Scheduler object runs the FlowDemo object every minute. That run method triggers data retrievalfrom the Flow Demo API, processes the results, and passes them onward.
da: Sådan indsamler vores Python-scripts data fra Flow Demo og videresender dem til Kafka. I main.py opretter vi et FlowDemo-objekt og et Scheduler-objekt. Scheduler-objektet kører FlowDemo-objektet hvert minut. Run-metoden udløser datahentning fra Flow Demo-API’et, behandler resultaterne og sender dem videre.
