Repository: SimonOnyszczakHansen/Website
Catalog: src/locale/messages.*.xlf
Languages: da

source: inside flow_demo.py, the run method goes through each sink, calls getHistory to retrieve snapshot data, and checks whether it’s valid and newer than the last timestamp. When it finds fresh data, it wraps that information in a JSON-like dictionary, then passes it to the Producer for publishing to a Kafka topic named data-distribution.
da: I filen flow_demo.py gennemgår run-metoden hver sink, kalder getHistory for at hente snapshot-data og kontrollerer, om det er gyldigt og nyere end det sidste tidsstempel. Når den finder nye data, pakker den oplysningerne ind i en JSON-lignende dictionary og sender dem til Producer for at publicere dem til et Kafka-emne med navnet data-distribution.

source: Data Consumption
da: Dataforbrug

source: The code first starts a Kafka consumer in a seperate thread wich continously reads messages off the data-distribution topic. Then inside a Dash callback, we process any messagesin the queue and convert them into Pandas Dataframes foreasy plotting. If no data has arrived yet, we display placeholder text. Otherwisem we draw a bar, pie, and line charts of the traffic counts by vehicle.
da: Koden starter først en Kafka-forbruger i en separat tråd, som kontinuerligt læser beskeder fra emnet data-distribution. Derefter behandler vi i et Dash-callback alle beskeder i køen og omdanner dem til Pandas DataFrames for nem visualisering. Hvis der endnu ikke er ankommet data, viser vi pladsholdertekst. Ellers tegner vi et søjlediagram, et cirkeldiagram og et linjediagram over trafiktællingerne fordelt på køretøjstyper.

source: In this second snippet, our Dash callback periodically checks the queue for new messages and updates three graphs accordingly. We use Plotly Express to create bar, pie, and line charts from the streaming data. Thanks to Dash’s reactive callbacks, the figures automatically refresh every few seconds, giving a live view of vehicle traffic distribution.
da: I dette andet uddrag tjekker vores Dash-callback periodisk køen for nye beskeder og opdaterer de tre grafer tilsvarende. Vi bruger Plotly Express til at skabe søjlediagrammer, cirkeldiagrammer og linjediagrammer ud fra de streamede data. Takket være Dashs reaktive callbacks opdateres figurerne automatisk hvert par sekunder, hvilket giver et live-overblik over fordelingen af køretøjstrafik.

source: This setup ensures that as new traffic data arrives, the consumer immediately adds it to the queue. Then, every few seconds, the Dash callback picks up that data, updates the visualizations, and displays fresh insights on the dashboard.
da: Opsætningen sikrer, at når nye trafikdata ankommer, tilføjer forbrugeren dem med det samme til køen. Derefter henter Dash-callbacken hvert par sekunder disse data, opdaterer visualiseringerne og viser nye indsigter på dashboardet.

# main header
source: Hey There, Check Out My <span>Work!</span>
da: Hej, se mit <span>arbejde!</span>

# under header
source: Check out the cool apps and coding projects I've been working on!
da: Tjek de spændende apps og kodningsprojekter jeg har arbejdet på!

# scroll down text
source: Scroll down
da: Rul ned

# Portionpal project description
source: School Project <span>— A website to control an automatic pet feeding machine</span>
da: Skole Projekt <span>— En brugergrænseflade til at kontrollere en automatisk kæledyrsfodringsmaskine</span>

# Password Generator project description
source: ZBC <span>— Giving people a unique and safe password</span>
da: ZBC <span>— Giver folk et unikt og sikkert password</span>

# Smart City Traffic Management project description
source: School Project <span>— A project where we used kafka to handle large amounts of data</span>
da: Skole Projekt <span>— Et projekt hvor vi gjorde brug af apache kafka til at håndtere store mængder data</span>
